The X coordinate
  Namespace:   Autodesk.Revit.DB.PointClouds
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public float X
  Visual Basic
Public X As Single
  Visual C++
public:
float X
 See Also
  CloudPoint Structure
  Autodesk.Revit.DB.PointClouds Namespace